MikroElektronika/core_packages/ARM/gcc_clang/def/hdsc/HC32F196PCTA/mcu.h
typedef struct
{
    union
    {
        __IO uint32_t PA00_SEL;
        stc_gpio_pa00_sel_field_t PA00_SEL_f;
    };
    union
    {
        __IO uint32_t PA01_SEL;
        stc_gpio_pa01_sel_field_t PA01_SEL_f;
    };
    union
    {
        __IO uint32_t PA02_SEL;
        stc_gpio_pa02_sel_field_t PA02_SEL_f;
    };
    union
    {
        __IO uint32_t PA03_SEL;
        stc_gpio_pa03_sel_field_t PA03_SEL_f;
    };
    union
    {
        __IO uint32_t PA04_SEL;
        stc_gpio_pa04_sel_field_t PA04_SEL_f;
    };
    union
    {
        __IO uint32_t PA05_SEL;
        stc_gpio_pa05_sel_field_t PA05_SEL_f;
    };
    union
    {
        __IO uint32_t PA06_SEL;
        stc_gpio_pa06_sel_field_t PA06_SEL_f;
    };
    union
    {
        __IO uint32_t PA07_SEL;
        stc_gpio_pa07_sel_field_t PA07_SEL_f;
    };
    union
    {
        __IO uint32_t PA08_SEL;
        stc_gpio_pa08_sel_field_t PA08_SEL_f;
    };
    union
    {
        __IO uint32_t PA09_SEL;
        stc_gpio_pa09_sel_field_t PA09_SEL_f;
    };
    union
    {
        __IO uint32_t PA10_SEL;
        stc_gpio_pa10_sel_field_t PA10_SEL_f;
    };
    union
    {
        __IO uint32_t PA11_SEL;
        stc_gpio_pa11_sel_field_t PA11_SEL_f;
    };
    union
    {
        __IO uint32_t PA12_SEL;
        stc_gpio_pa12_sel_field_t PA12_SEL_f;
    };
    union
    {
        __IO uint32_t PA13_SEL;
        stc_gpio_pa13_sel_field_t PA13_SEL_f;
    };
    union
    {
        __IO uint32_t PA14_SEL;
        stc_gpio_pa14_sel_field_t PA14_SEL_f;
    };
    union
    {
        __IO uint32_t PA15_SEL;
        stc_gpio_pa15_sel_field_t PA15_SEL_f;
    };
    union
    {
        __IO uint32_t PB00_SEL;
        stc_gpio_pb00_sel_field_t PB00_SEL_f;
    };
    union
    {
        __IO uint32_t PB01_SEL;
        stc_gpio_pb01_sel_field_t PB01_SEL_f;
    };
    union
    {
        __IO uint32_t PB02_SEL;
        stc_gpio_pb02_sel_field_t PB02_SEL_f;
    };
    union
    {
        __IO uint32_t PB03_SEL;
        stc_gpio_pb03_sel_field_t PB03_SEL_f;
    };
    union
    {
        __IO uint32_t PB04_SEL;
        stc_gpio_pb04_sel_field_t PB04_SEL_f;
    };
    union
    {
        __IO uint32_t PB05_SEL;
        stc_gpio_pb05_sel_field_t PB05_SEL_f;
    };
    union
    {
        __IO uint32_t PB06_SEL;
        stc_gpio_pb06_sel_field_t PB06_SEL_f;
    };
    union
    {
        __IO uint32_t PB07_SEL;
        stc_gpio_pb07_sel_field_t PB07_SEL_f;
    };
    union
    {
        __IO uint32_t PB08_SEL;
        stc_gpio_pb08_sel_field_t PB08_SEL_f;
    };
    union
    {
        __IO uint32_t PB09_SEL;
        stc_gpio_pb09_sel_field_t PB09_SEL_f;
    };
    union
    {
        __IO uint32_t PB10_SEL;
        stc_gpio_pb10_sel_field_t PB10_SEL_f;
    };
    union
    {
        __IO uint32_t PB11_SEL;
        stc_gpio_pb11_sel_field_t PB11_SEL_f;
    };
    union
    {
        __IO uint32_t PB12_SEL;
        stc_gpio_pb12_sel_field_t PB12_SEL_f;
    };
    union
    {
        __IO uint32_t PB13_SEL;
        stc_gpio_pb13_sel_field_t PB13_SEL_f;
    };
    union
    {
        __IO uint32_t PB14_SEL;
        stc_gpio_pb14_sel_field_t PB14_SEL_f;
    };
    union
    {
        __IO uint32_t PB15_SEL;
        stc_gpio_pb15_sel_field_t PB15_SEL_f;
    };
    union
    {
        __IO uint32_t PC00_SEL;
        stc_gpio_pc00_sel_field_t PC00_SEL_f;
    };
    union
    {
        __IO uint32_t PC01_SEL;
        stc_gpio_pc01_sel_field_t PC01_SEL_f;
    };
    union
    {
        __IO uint32_t PC02_SEL;
        stc_gpio_pc02_sel_field_t PC02_SEL_f;
    };
    union
    {
        __IO uint32_t PC03_SEL;
        stc_gpio_pc03_sel_field_t PC03_SEL_f;
    };
    union
    {
        __IO uint32_t PC04_SEL;
        stc_gpio_pc04_sel_field_t PC04_SEL_f;
    };
    union
    {
        __IO uint32_t PC05_SEL;
        stc_gpio_pc05_sel_field_t PC05_SEL_f;
    };
    union
    {
        __IO uint32_t PC06_SEL;
        stc_gpio_pc06_sel_field_t PC06_SEL_f;
    };
    union
    {
        __IO uint32_t PC07_SEL;
        stc_gpio_pc07_sel_field_t PC07_SEL_f;
    };
    union
    {
        __IO uint32_t PC08_SEL;
        stc_gpio_pc08_sel_field_t PC08_SEL_f;
    };
    union
    {
        __IO uint32_t PC09_SEL;
        stc_gpio_pc09_sel_field_t PC09_SEL_f;
    };
    union
    {
        __IO uint32_t PC10_SEL;
        stc_gpio_pc10_sel_field_t PC10_SEL_f;
    };
    union
    {
        __IO uint32_t PC11_SEL;
        stc_gpio_pc11_sel_field_t PC11_SEL_f;
    };
    union
    {
        __IO uint32_t PC12_SEL;
        stc_gpio_pc12_sel_field_t PC12_SEL_f;
    };
    union
    {
        __IO uint32_t PC13_SEL;
        stc_gpio_pc13_sel_field_t PC13_SEL_f;
    };
    union
    {
        __IO uint32_t PC14_SEL;
        stc_gpio_pc14_sel_field_t PC14_SEL_f;
    };
    union
    {
        __IO uint32_t PC15_SEL;
        stc_gpio_pc15_sel_field_t PC15_SEL_f;
    };
    union
    {
        __IO uint32_t PD00_SEL;
        stc_gpio_pd00_sel_field_t PD00_SEL_f;
    };
    union
    {
        __IO uint32_t PD01_SEL;
        stc_gpio_pd01_sel_field_t PD01_SEL_f;
    };
    union
    {
        __IO uint32_t PD02_SEL;
        stc_gpio_pd02_sel_field_t PD02_SEL_f;
    };
    union
    {
        __IO uint32_t PD03_SEL;
        stc_gpio_pd03_sel_field_t PD03_SEL_f;
    };
    union
    {
        __IO uint32_t PD04_SEL;
        stc_gpio_pd04_sel_field_t PD04_SEL_f;
    };
    union
    {
        __IO uint32_t PD05_SEL;
        stc_gpio_pd05_sel_field_t PD05_SEL_f;
    };
    union
    {
        __IO uint32_t PD06_SEL;
        stc_gpio_pd06_sel_field_t PD06_SEL_f;
    };
    union
    {
        __IO uint32_t PD07_SEL;
        stc_gpio_pd07_sel_field_t PD07_SEL_f;
    };
    union
    {
        __IO uint32_t PD08_SEL;
        stc_gpio_pd08_sel_field_t PD08_SEL_f;
    };
    union
    {
        __IO uint32_t PD09_SEL;
        stc_gpio_pd09_sel_field_t PD09_SEL_f;
    };
    union
    {
        __IO uint32_t PD10_SEL;
        stc_gpio_pd10_sel_field_t PD10_SEL_f;
    };
    union
    {
        __IO uint32_t PD11_SEL;
        stc_gpio_pd11_sel_field_t PD11_SEL_f;
    };
    union
    {
        __IO uint32_t PD12_SEL;
        stc_gpio_pd12_sel_field_t PD12_SEL_f;
    };
    union
    {
        __IO uint32_t PD13_SEL;
        stc_gpio_pd13_sel_field_t PD13_SEL_f;
    };
    union
    {
        __IO uint32_t PD14_SEL;
        stc_gpio_pd14_sel_field_t PD14_SEL_f;
    };
    union
    {
        __IO uint32_t PD15_SEL;
        stc_gpio_pd15_sel_field_t PD15_SEL_f;
    };
    union
    {
        __IO uint32_t PADIR;
        stc_gpio_padir_field_t PADIR_f;
    };
    union
    {
        __IO uint32_t PAIN;
        stc_gpio_pain_field_t PAIN_f;
    };
    union
    {
        __IO uint32_t PAOUT;
        stc_gpio_paout_field_t PAOUT_f;
    };
    union
    {
        __IO uint32_t PAADS;
        stc_gpio_paads_field_t PAADS_f;
    };
    union
    {
        __IO uint32_t PABSET;
        stc_gpio_pabset_field_t PABSET_f;
    };
    union
    {
        __IO uint32_t PABCLR;
        stc_gpio_pabclr_field_t PABCLR_f;
    };
    union
    {
        __IO uint32_t PABSETCLR;
        stc_gpio_pabsetclr_field_t PABSETCLR_f;
    };
    union
    {
        __IO uint32_t PADR;
        stc_gpio_padr_field_t PADR_f;
    };
    union
    {
        __IO uint32_t PAPU;
        stc_gpio_papu_field_t PAPU_f;
    };
    union
    {
        __IO uint32_t PAPD;
        stc_gpio_papd_field_t PAPD_f;
    };
    uint8_t RESERVED74[4];
    union
    {
        __IO uint32_t PAOD;
        stc_gpio_paod_field_t PAOD_f;
    };
    union
    {
        __IO uint32_t PAHIE;
        stc_gpio_pahie_field_t PAHIE_f;
    };
    union
    {
        __IO uint32_t PALIE;
        stc_gpio_palie_field_t PALIE_f;
    };
    union
    {
        __IO uint32_t PARIE;
        stc_gpio_parie_field_t PARIE_f;
    };
    union
    {
        __IO uint32_t PAFIE;
        stc_gpio_pafie_field_t PAFIE_f;
    };
    union
    {
        __IO uint32_t PBDIR;
        stc_gpio_pbdir_field_t PBDIR_f;
    };
    union
    {
        __IO uint32_t PBIN;
        stc_gpio_pbin_field_t PBIN_f;
    };
    union
    {
        __IO uint32_t PBOUT;
        stc_gpio_pbout_field_t PBOUT_f;
    };
    union
    {
        __IO uint32_t PBADS;
        stc_gpio_pbads_field_t PBADS_f;
    };
    union
    {
        __IO uint32_t PBBSET;
        stc_gpio_pbbset_field_t PBBSET_f;
    };
    union
    {
        __IO uint32_t PBBCLR;
        stc_gpio_pbbclr_field_t PBBCLR_f;
    };
    union
    {
        __IO uint32_t PBBSETCLR;
        stc_gpio_pbbsetclr_field_t PBBSETCLR_f;
    };
    union
    {
        __IO uint32_t PBDR;
        stc_gpio_pbdr_field_t PBDR_f;
    };
    union
    {
        __IO uint32_t PBPU;
        stc_gpio_pbpu_field_t PBPU_f;
    };
    union
    {
        __IO uint32_t PBPD;
        stc_gpio_pbpd_field_t PBPD_f;
    };
    uint8_t RESERVED89[4];
    union
    {
        __IO uint32_t PBOD;
        stc_gpio_pbod_field_t PBOD_f;
    };
    union
    {
        __IO uint32_t PBHIE;
        stc_gpio_pbhie_field_t PBHIE_f;
    };
    union
    {
        __IO uint32_t PBLIE;
        stc_gpio_pblie_field_t PBLIE_f;
    };
    union
    {
        __IO uint32_t PBRIE;
        stc_gpio_pbrie_field_t PBRIE_f;
    };
    union
    {
        __IO uint32_t PBFIE;
        stc_gpio_pbfie_field_t PBFIE_f;
    };
    union
    {
        __IO uint32_t PCDIR;
        stc_gpio_pcdir_field_t PCDIR_f;
    };
    union
    {
        __IO uint32_t PCIN;
        stc_gpio_pcin_field_t PCIN_f;
    };
    union
    {
        __IO uint32_t PCOUT;
        stc_gpio_pcout_field_t PCOUT_f;
    };
    union
    {
        __IO uint32_t PCADS;
        stc_gpio_pcads_field_t PCADS_f;
    };
    union
    {
        __IO uint32_t PCBSET;
        stc_gpio_pcbset_field_t PCBSET_f;
    };
    union
    {
        __IO uint32_t PCBCLR;
        stc_gpio_pcbclr_field_t PCBCLR_f;
    };
    union
    {
        __IO uint32_t PCBSETCLR;
        stc_gpio_pcbsetclr_field_t PCBSETCLR_f;
    };
    union
    {
        __IO uint32_t PCDR;
        stc_gpio_pcdr_field_t PCDR_f;
    };
    union
    {
        __IO uint32_t PCPU;
        stc_gpio_pcpu_field_t PCPU_f;
    };
    union
    {
        __IO uint32_t PCPD;
        stc_gpio_pcpd_field_t PCPD_f;
    };
    uint8_t RESERVED104[4];
    union
    {
        __IO uint32_t PCOD;
        stc_gpio_pcod_field_t PCOD_f;
    };
    union
    {
        __IO uint32_t PCHIE;
        stc_gpio_pchie_field_t PCHIE_f;
    };
    union
    {
        __IO uint32_t PCLIE;
        stc_gpio_pclie_field_t PCLIE_f;
    };
    union
    {
        __IO uint32_t PCRIE;
        stc_gpio_pcrie_field_t PCRIE_f;
    };
    union
    {
        __IO uint32_t PCFIE;
        stc_gpio_pcfie_field_t PCFIE_f;
    };
    union
    {
        __IO uint32_t PDDIR;
        stc_gpio_pddir_field_t PDDIR_f;
    };
    union
    {
        __IO uint32_t PDIN;
        stc_gpio_pdin_field_t PDIN_f;
    };
    union
    {
        __IO uint32_t PDOUT;
        stc_gpio_pdout_field_t PDOUT_f;
    };
    union
    {
        __IO uint32_t PDADS;
        stc_gpio_pdads_field_t PDADS_f;
    };
    union
    {
        __IO uint32_t PDBSET;
        stc_gpio_pdbset_field_t PDBSET_f;
    };
    union
    {
        __IO uint32_t PDBCLR;
        stc_gpio_pdbclr_field_t PDBCLR_f;
    };
    union
    {
        __IO uint32_t PDBSETCLR;
        stc_gpio_pdbsetclr_field_t PDBSETCLR_f;
    };
    union
    {
        __IO uint32_t PDDR;
        stc_gpio_pddr_field_t PDDR_f;
    };
    union
    {
        __IO uint32_t PDPU;
        stc_gpio_pdpu_field_t PDPU_f;
    };
    union
    {
        __IO uint32_t PDPD;
        stc_gpio_pdpd_field_t PDPD_f;
    };
    uint8_t RESERVED119[4];
    union
    {
        __IO uint32_t PDOD;
        stc_gpio_pdod_field_t PDOD_f;
    };
    union
    {
        __IO uint32_t PDHIE;
        stc_gpio_pdhie_field_t PDHIE_f;
    };
    union
    {
        __IO uint32_t PDLIE;
        stc_gpio_pdlie_field_t PDLIE_f;
    };
    union
    {
        __IO uint32_t PDRIE;
        stc_gpio_pdrie_field_t PDRIE_f;
    };
    union
    {
        __IO uint32_t PDFIE;
        stc_gpio_pdfie_field_t PDFIE_f;
    };
    union
    {
        __IO uint32_t PA_STAT;
        stc_gpio_pa_stat_field_t PA_STAT_f;
    };
    uint8_t RESERVED125[12];
    union
    {
        __IO uint32_t PA_ICLR;
        stc_gpio_pa_iclr_field_t PA_ICLR_f;
    };
    uint8_t RESERVED126[44];
    union
    {
        __IO uint32_t PB_STAT;
        stc_gpio_pb_stat_field_t PB_STAT_f;
    };
    uint8_t RESERVED127[12];
    union
    {
        __IO uint32_t PB_ICLR;
        stc_gpio_pb_iclr_field_t PB_ICLR_f;
    };
    uint8_t RESERVED128[44];
    union
    {
        __IO uint32_t PC_STAT;
        stc_gpio_pc_stat_field_t PC_STAT_f;
    };
    uint8_t RESERVED129[12];
    union
    {
        __IO uint32_t PC_ICLR;
        stc_gpio_pc_iclr_field_t PC_ICLR_f;
    };
    uint8_t RESERVED130[44];
    union
    {
        __IO uint32_t PD_STAT;
        stc_gpio_pd_stat_field_t PD_STAT_f;
    };
    uint8_t RESERVED131[12];
    union
    {
        __IO uint32_t PD_ICLR;
        stc_gpio_pd_iclr_field_t PD_ICLR_f;
    };
    uint8_t RESERVED132[44];
    union
    {
        __IO uint32_t CTRL0;
        stc_gpio_ctrl0_field_t CTRL0_f;
    };
    union
    {
        __IO uint32_t CTRL1;
        stc_gpio_ctrl1_field_t CTRL1_f;
    };
    union
    {
        __IO uint32_t CTRL2;
        stc_gpio_ctrl2_field_t CTRL2_f;
    };
    union
    {
        __IO uint32_t TIMGS;
        stc_gpio_timgs_field_t TIMGS_f;
    };
    union
    {
        __IO uint32_t TIMES;
        stc_gpio_times_field_t TIMES_f;
    };
    union
    {
        __IO uint32_t TIMCPS;
        stc_gpio_timcps_field_t TIMCPS_f;
    };
    union
    {
        __IO uint32_t PCAS;
        stc_gpio_pcas_field_t PCAS_f;
    };
    union
    {
        __IO uint32_t PCNT;
        stc_gpio_pcnt_field_t PCNT_f;
    };
    uint8_t RESERVED140[3296];
    union
    {
        __IO uint32_t PE00_SEL;
        stc_gpio_pe00_sel_field_t PE00_SEL_f;
    };
    union
    {
        __IO uint32_t PE01_SEL;
        stc_gpio_pe01_sel_field_t PE01_SEL_f;
    };
    union
    {
        __IO uint32_t PE02_SEL;
        stc_gpio_pe02_sel_field_t PE02_SEL_f;
    };
    union
    {
        __IO uint32_t PE03_SEL;
        stc_gpio_pe03_sel_field_t PE03_SEL_f;
    };
    union
    {
        __IO uint32_t PE04_SEL;
        stc_gpio_pe04_sel_field_t PE04_SEL_f;
    };
    union
    {
        __IO uint32_t PE05_SEL;
        stc_gpio_pe05_sel_field_t PE05_SEL_f;
    };
    union
    {
        __IO uint32_t PE06_SEL;
        stc_gpio_pe06_sel_field_t PE06_SEL_f;
    };
    union
    {
        __IO uint32_t PE07_SEL;
        stc_gpio_pe07_sel_field_t PE07_SEL_f;
    };
    union
    {
        __IO uint32_t PE08_SEL;
        stc_gpio_pe08_sel_field_t PE08_SEL_f;
    };
    union
    {
        __IO uint32_t PE09_SEL;
        stc_gpio_pe09_sel_field_t PE09_SEL_f;
    };
    union
    {
        __IO uint32_t PE10_SEL;
        stc_gpio_pe10_sel_field_t PE10_SEL_f;
    };
    union
    {
        __IO uint32_t PE11_SEL;
        stc_gpio_pe11_sel_field_t PE11_SEL_f;
    };
    union
    {
        __IO uint32_t PE12_SEL;
        stc_gpio_pe12_sel_field_t PE12_SEL_f;
    };
    union
    {
        __IO uint32_t PE13_SEL;
        stc_gpio_pe13_sel_field_t PE13_SEL_f;
    };
    union
    {
        __IO uint32_t PE14_SEL;
        stc_gpio_pe14_sel_field_t PE14_SEL_f;
    };
    union
    {
        __IO uint32_t PE15_SEL;
        stc_gpio_pe15_sel_field_t PE15_SEL_f;
    };
    union
    {
        __IO uint32_t PF00_SEL;
        stc_gpio_pf00_sel_field_t PF00_SEL_f;
    };
    union
    {
        __IO uint32_t PF01_SEL;
        stc_gpio_pf01_sel_field_t PF01_SEL_f;
    };
    union
    {
        __IO uint32_t PF02_SEL;
        stc_gpio_pf02_sel_field_t PF02_SEL_f;
    };
    union
    {
        __IO uint32_t PF03_SEL;
        stc_gpio_pf03_sel_field_t PF03_SEL_f;
    };
    union
    {
        __IO uint32_t PF04_SEL;
        stc_gpio_pf04_sel_field_t PF04_SEL_f;
    };
    union
    {
        __IO uint32_t PF05_SEL;
        stc_gpio_pf05_sel_field_t PF05_SEL_f;
    };
    union
    {
        __IO uint32_t PF06_SEL;
        stc_gpio_pf06_sel_field_t PF06_SEL_f;
    };
    union
    {
        __IO uint32_t PF07_SEL;
        stc_gpio_pf07_sel_field_t PF07_SEL_f;
    };
    union
    {
        __IO uint32_t PF08_SEL;
        stc_gpio_pf08_sel_field_t PF08_SEL_f;
    };
    union
    {
        __IO uint32_t PF09_SEL;
        stc_gpio_pf09_sel_field_t PF09_SEL_f;
    };
    union
    {
        __IO uint32_t PF10_SEL;
        stc_gpio_pf10_sel_field_t PF10_SEL_f;
    };
    union
    {
        __IO uint32_t PF11_SEL;
        stc_gpio_pf11_sel_field_t PF11_SEL_f;
    };
    uint8_t RESERVED168[144];
    union
    {
        __IO uint32_t PEDIR;
        stc_gpio_pedir_field_t PEDIR_f;
    };
    union
    {
        __IO uint32_t PEIN;
        stc_gpio_pein_field_t PEIN_f;
    };
    union
    {
        __IO uint32_t PEOUT;
        stc_gpio_peout_field_t PEOUT_f;
    };
    union
    {
        __IO uint32_t PEADS;
        stc_gpio_peads_field_t PEADS_f;
    };
    union
    {
        __IO uint32_t PEBSET;
        stc_gpio_pebset_field_t PEBSET_f;
    };
    union
    {
        __IO uint32_t PEBCLR;
        stc_gpio_pebclr_field_t PEBCLR_f;
    };
    union
    {
        __IO uint32_t PEBSETCLR;
        stc_gpio_pebsetclr_field_t PEBSETCLR_f;
    };
    union
    {
        __IO uint32_t PEDR;
        stc_gpio_pedr_field_t PEDR_f;
    };
    union
    {
        __IO uint32_t PEPU;
        stc_gpio_pepu_field_t PEPU_f;
    };
    union
    {
        __IO uint32_t PEPD;
        stc_gpio_pepd_field_t PEPD_f;
    };
    uint8_t RESERVED178[4];
    union
    {
        __IO uint32_t PEOD;
        stc_gpio_peod_field_t PEOD_f;
    };
    union
    {
        __IO uint32_t PEHIE;
        stc_gpio_pehie_field_t PEHIE_f;
    };
    union
    {
        __IO uint32_t PELIE;
        stc_gpio_pelie_field_t PELIE_f;
    };
    union
    {
        __IO uint32_t PERIE;
        stc_gpio_perie_field_t PERIE_f;
    };
    union
    {
        __IO uint32_t PEFIE;
        stc_gpio_pefie_field_t PEFIE_f;
    };
    union
    {
        __IO uint32_t PFDIR;
        stc_gpio_pfdir_field_t PFDIR_f;
    };
    union
    {
        __IO uint32_t PFIN;
        stc_gpio_pfin_field_t PFIN_f;
    };
    union
    {
        __IO uint32_t PFOUT;
        stc_gpio_pfout_field_t PFOUT_f;
    };
    union
    {
        __IO uint32_t PFADS;
        stc_gpio_pfads_field_t PFADS_f;
    };
    union
    {
        __IO uint32_t PFBSET;
        stc_gpio_pfbset_field_t PFBSET_f;
    };
    union
    {
        __IO uint32_t PFBCLR;
        stc_gpio_pfbclr_field_t PFBCLR_f;
    };
    union
    {
        __IO uint32_t PFBSETCLR;
        stc_gpio_pfbsetclr_field_t PFBSETCLR_f;
    };
    union
    {
        __IO uint32_t PFDR;
        stc_gpio_pfdr_field_t PFDR_f;
    };
    union
    {
        __IO uint32_t PFPU;
        stc_gpio_pfpu_field_t PFPU_f;
    };
    union
    {
        __IO uint32_t PFPD;
        stc_gpio_pfpd_field_t PFPD_f;
    };
    uint8_t RESERVED193[4];
    union
    {
        __IO uint32_t PFOD;
        stc_gpio_pfod_field_t PFOD_f;
    };
    union
    {
        __IO uint32_t PFHIE;
        stc_gpio_pfhie_field_t PFHIE_f;
    };
    union
    {
        __IO uint32_t PFLIE;
        stc_gpio_pflie_field_t PFLIE_f;
    };
    union
    {
        __IO uint32_t PFRIE;
        stc_gpio_pfrie_field_t PFRIE_f;
    };
    union
    {
        __IO uint32_t PFFIE;
        stc_gpio_pffie_field_t PFFIE_f;
    };
    uint8_t RESERVED198[128];
    union
    {
        __IO uint32_t PE_STAT;
        stc_gpio_pe_stat_field_t PE_STAT_f;
    };
    uint8_t RESERVED199[12];
    union
    {
        __IO uint32_t PE_ICLR;
        stc_gpio_pe_iclr_field_t PE_ICLR_f;
    };
    uint8_t RESERVED200[44];
    union
    {
        __IO uint32_t PF_STAT;
        stc_gpio_pf_stat_field_t PF_STAT_f;
    };
    uint8_t RESERVED201[12];
    union
    {
        __IO uint32_t PF_ICLR;
        stc_gpio_pf_iclr_field_t PF_ICLR_f;
    };
}M0P_GPIO_TypeDef;

typedef struct
{
    union
    {
        __IO uint32_t TMRUN;
        stc_i2c_tmrun_field_t TMRUN_f;
    };
    union
    {
        __IO uint32_t TM;
        stc_i2c_tm_field_t TM_f;
    };
    union
    {
        __IO uint32_t CR;
        stc_i2c_cr_field_t CR_f;
    };
    union
    {
        __IO uint32_t DATA;
        stc_i2c_data_field_t DATA_f;
    };
    union
    {
        __IO uint32_t ADDR;
        stc_i2c_addr_field_t ADDR_f;
    };
    union
    {
        __IO uint32_t STAT;
        stc_i2c_stat_field_t STAT_f;
    };
}M0P_I2C_TypeDef;

typedef struct
{
    union
    {
        __IO uint32_t CR0;
        stc_lcd_cr0_field_t CR0_f;
    };
    union
    {
        __IO uint32_t CR1;
        stc_lcd_cr1_field_t CR1_f;
    };
    union
    {
        __IO uint32_t INTCLR;
        stc_lcd_intclr_field_t INTCLR_f;
    };
    union
    {
        __IO uint32_t POEN0;
        stc_lcd_poen0_field_t POEN0_f;
    };
    union
    {
        __IO uint32_t POEN1;
        stc_lcd_poen1_field_t POEN1_f;
    };
    uint8_t RESERVED5[44];
    union
    {
        __IO uint32_t RAM0;
        stc_lcd_ram0_field_t RAM0_f;
    };
    union
    {
        __IO uint32_t RAM1;
        stc_lcd_ram1_field_t RAM1_f;
    };
    union
    {
        __IO uint32_t RAM2;
        stc_lcd_ram2_field_t RAM2_f;
    };
    union
    {
        __IO uint32_t RAM3;
        stc_lcd_ram3_field_t RAM3_f;
    };
    union
    {
        __IO uint32_t RAM4;
        stc_lcd_ram4_field_t RAM4_f;
    };
    union
    {
        __IO uint32_t RAM5;
        stc_lcd_ram5_field_t RAM5_f;
    };
    union
    {
        __IO uint32_t RAM6;
        stc_lcd_ram6_field_t RAM6_f;
    };
    union
    {
        __IO uint32_t RAM7;
        stc_lcd_ram7_field_t RAM7_f;
    };
    union
    {
        __IO uint32_t RAM8;
        stc_lcd_ram8_field_t RAM8_f;
    };
    union
    {
        __IO uint32_t RAM9;
        stc_lcd_ram9_field_t RAM9_f;
    };
    union
    {
        __IO uint32_t RAMA;
        stc_lcd_rama_field_t RAMA_f;
    };
    union
    {
        __IO uint32_t RAMB;
        stc_lcd_ramb_field_t RAMB_f;
    };
    union
    {
        __IO uint32_t RAMC;
        stc_lcd_ramc_field_t RAMC_f;
    };
    union
    {
        __IO uint32_t RAMD;
        stc_lcd_ramd_field_t RAMD_f;
    };
    union
    {
        __IO uint32_t RAME;
        stc_lcd_rame_field_t RAME_f;
    };
    union
    {
        __IO uint32_t RAMF;
        stc_lcd_ramf_field_t RAMF_f;
    };
}M0P_LCD_TypeDef;

typedef struct
{
    uint8_t RESERVED0[40];
    union
    {
        __IO uint32_t CR;
        stc_lvd_cr_field_t CR_f;
    };
    union
    {
        __IO uint32_t IFR;
        stc_lvd_ifr_field_t IFR_f;
    };
}M0P_LVD_TypeDef;

typedef struct
{
    uint8_t RESERVED0[48];
    union
    {
        __IO uint32_t CR0;
        stc_opa_cr0_field_t CR0_f;
    };
    uint8_t RESERVED1[8];
    union
    {
        __IO uint32_t CR1;
        stc_opa_cr1_field_t CR1_f;
    };
}M0P_OPA_TypeDef;

